app/controllers/auth_token_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "tokens" SET "token" = ?, "updated_at" = ? WHERE "tokens"."id" = 1  [["token", nil], ["updated_at", "2015-02-06 15:39:05.147319"]]
---
    def delete_token
        user = User.find(params[:user_id])
        user.token.token = nil
        user.token.save

UPDATE "tokens" SET "token" = ?, "updated_at" = ? WHERE "tokens"."id" = 1  [["token", 91044993984138045105954590822212900992], ["updated_at", "2015-02-05 15:06:26.221995"]]
---
    def gen_token
        current_user.token.token = assign_token
        current_user.token.save