app/controllers/login_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" = '' LIMIT 1
---
    def login
        email = params[:email]
        password = params[:password]

        message = "";

        appUser = User.find_by_email(email)