app/controllers/users_controller.rb

SELECT  "users".* FROM "users"   ORDER BY "users"."id" ASC LIMIT 1
---
    def index
        if !current_user.nil?
            if !is_admin
                redirect_to auth_token_path
            end

            @users = User.all

INSERT INTO "users" ("created_at", "email", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-01-30 15:53:36.635122"], ["email", "sfad"], ["name", "afs"], ["password", "fsad"], ["updated_at", "2015-01-30 15:53:36.635122"]]
INSERT INTO "tokens" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2015-02-03 23:47:50.461685"], ["updated_at", "2015-02-03 23:47:50.461685"], ["user_id", 3]]
---
    def create
        u = User.new(user_params)
        messages = Array.new

        if u.save
            Token.create user_id = u.id